<template>
  <div class="page">
    <img class="bubble bubble-1" src="../assets/pngs/bubble.png" alt="" />
    <img class="bubble bubble-2" src="../assets/pngs/bubble.png" alt="" />
    <img class="bubble bubble-3" src="../assets/pngs/bubble.png" alt="" />
    <img class="bubble bubble-4" src="../assets/pngs/bubble.png" alt="" />
    <img class="bubble bubble-5" src="../assets/pngs/bubble.png" alt="" />
    <img class="bubble bubble-6" src="../assets/pngs/bubble.png" alt="" />
    <img class="bubble bubble-7" src="../assets/pngs/bubble.png" alt="" />

    <div class="main-container coolers-container">
      <ProductCardTabs
        :key="card"
        :image="card.image"
        :header="card.header"
        :description="card.description"
        :characteristic="card.characteristic"
        :price="card.price"
        :rentPrice="card.rentPrice"
        :mortgagePrice="card.mortgagePrice"
        v-for="card in tabsCards"
      />
    </div>
  </div>
</template>

<script>
import ProductCardTabs from '@/components/ProductCardTabs.vue'
import cooler_1 from '../assets/pngs/coolers/1.png'
import cooler_2 from '../assets/pngs/coolers/2.png'
import cooler_3 from '../assets/pngs/coolers/3.png'
import cooler_4 from '../assets/pngs/coolers/4.png'
import cooler_5 from '../assets/pngs/coolers/5.png'
import cooler_6 from '../assets/pngs/coolers/6.png'
import cooler_7 from '../assets/pngs/coolers/7.png'

export default {
  components: {
    ProductCardTabs
  },
  data() {
    return {
      tabsCards: [
        {
          image: cooler_1,
          header: 'VIO 903-FNC White',
          description: `Кулер для води ВіО є функціональною заміною електрочайника. Адже він також не має функції охолодження, але надійно працює на підігрів. Температура гарячої води становить 90-95°С, чого достатньо для приготування чаю або кави. Крім того, при такій температурі вода не кипить, а значить, зберігає свої корисні властивості.
Кулер ВіО Х903-FNC має ергономічний дизайн і простий інтерфейс. Крім того, в нижній частині кулера є практична шафка, в якій можна зберігати стаканчики, цукор, чай або каву.`,
          characteristic: `<b>Вода:</b>  гаряча-кімнатна \n<b>Колір:</b> білий \n<b>Розміщення бутлі:</b> зверху - на кулері\n<b>Тип охолодження:</b> без охолодження\n<b>Тип шафки:</b> звичайна шафка\n<b>Об'єм шафки:</b> 16 л\n<b>Захист від дітей:</b> є захист від дітей\n<b>Тип краника:</b> натиск рукою кнопки-клавiши\n<b>Сховище для одноразових стаканчиків:</b> купується окремо\n<b>Розмір ш*в*г (мм):</b> 310 * 955 * 320 мм\n<b>Розмір коробки ш*в*г (см):</b> 330 * 1000 * 335 мм\n<b>Енергоспоживання:</b> 1.20 кВт г/добу\n<b>Клас енергоефективності:</b> В\n<b>Експлуатація при температурі:</b> від +10°C до +38°C\n<b>Гарантія:</b> 2 роки\n<b>Наявність крана кімнатної температури:</b> так\n<b>Додаткові опції:</b> Захист від дітей\n`,
          price: ' 4300 грн',
          rentPrice: '250 грн/міс.',
          mortgagePrice: '2100 грн'
        },
        {
          image: cooler_2,
          header: 'VIO 903-FEC Silver',
          description: `Куллер ViO X-903 FEC Silver має електронний тип охолодження (повільний тип), яке відрізняється невеликою продуктивністю. Температура холодної води досягає 10-15 градусів за 50-60 хвилин, чого цілком достатньо для того, щоб вгамувати спрагу спекотного дня. Даний кулер має функцію нагрівання до 90-95 градусів і подає воду гарячої температури з крана з червоною вставкою. Другий кран подає воду холодної температури, а третій - воду кімнатної температури. Такий кулер відмінне придбання для дому та офісу.`,
          characteristic: `<b>Вода:</b>  гаряча-прохолодна-холодна \n<b>Колір:</b> сріблястий \n<b>Розміщення бутлі:</b> зверху - на кулері\n<b>Тип охолодження:</b> електронне охолодження\n<b>Тип шафки:</b> звичайна шафка\n<b>Об'єм шафки:</b> 16 л\n<b>Захист від дітей:</b> є захист від дітей\n<b>Тип краника:</b> натиск рукою кнопки-клавiши\n<b>Сховище для одноразових стаканчиків:</b> купується окремо\n<b>Розмір ш*в*г (мм):</b> 310 * 955 * 320 мм\n<b>Розмір коробки ш*в*г (см):</b> 330 * 1000 * 320 мм\n<b>Енергоспоживання:</b> 1.20 кВт г/добу\n<b>Клас енергоефективності:</b> В\n<b>Експлуатація при температурі:</b> від +10°C до +38°C\n<b>Гарантія:</b> 2 роки\n<b>Наявність крана кімнатної температури:</b> так\n<b>Додаткові опції:</b> Захист від дітей, три режиму подачі води (гаряча, кімнатна і холодна)\n`,

          price: ' 5000 грн',
          rentPrice: '300 грн/міс.',
          mortgagePrice: '2500 грн'
        },
        {
          image: cooler_3,
          header: 'VIO 903-FEС Black',
          description: `Даний кулер має функцію нагрівання до 90-95 градусів і подає воду гарячої температури з крана з червоною вставкою.
Другий кран подає воду холодної температури, а третій - воду кімнатної температури. Такий кулер відмінне придбання для дому та офісу.
Має кнопкові крани - найзручніший варіант кранів для домашніх, офісних експлуатації. Величезний плюс таких кранів - гігієнічний і простий розлив води,
з яким впораються і дорослі, і діти.
Кран гарячої води оснащений захистом від дітей. Вона представлена у вигляді слайд-кнопки. Щоб здійснити розлив води, необхідно зафіксувати кнопку захисту в активному стані.
У нижній частині корпусу кулера з охолодженням розміщена шафа (це не холодильник, а звичайна шафка), в якому можна зберігати посуд, кава, чай, саха та інше.
Водораздатчики ViO X-903 FEC Black має світлодіодну індикацію на нагрівання та охолодження на верхній панелі корпусу.`,
          characteristic: `<b>Вода:</b>  гаряча-прохолодна-холодна \n<b>Колір:</b> чорний \n<b>Розміщення бутлі:</b> зверху - на кулері\n<b>Тип охолодження:</b> електронне охолодження\n<b>Тип шафки:</b> звичайна шафка\n<b>Об'єм шафки:</b> 16 л\n<b>Захист від дітей:</b> є захист від дітей\n<b>Тип краника:</b> натиск рукою кнопки-клавiши\n<b>Сховище для одноразових стаканчиків:</b> купується окремо\n<b>Розмір ш*в*г (мм):</b> 310 * 955 * 320 мм\n<b>Розмір коробки ш*в*г (см):</b> 330 * 1000 * 335 мм\n<b>Енергоспоживання:</b> 1.20 кВт г/добу\n<b>Клас енергоефективності:</b> В\n<b>Експлуатація при температурі:</b> від +10°C до +38°C\n<b>Гарантія:</b> 2 роки\n<b>Наявність крана кімнатної температури:</b> так\n<b>Додаткові опції:</b> Захист від дітей, три режиму подачі води (гаряча, кімнатна і холодна)\n`,

          price: ' 6000 грн',
          rentPrice: '300 грн/міс.',
          mortgagePrice: '3000 грн'
        },
        {
          image: cooler_4,
          header: 'Cooper&Hunter CH-V127C',
          description: `Модель кулера Cooper & Hunter CH-V127C призначена для будинку, офісу, їдальні чи іншого місця, де може стати в нагоді питна холодна і гаряча вода. Він виконаний в білому кольорі. На передній частині є індикатори і кнопки запуску. Також там є підставка під чашки і піддоном для крапель. Модель виробляє холодну і гарячу воду. Так що ви зможете приготувати каву або чай, швидкий сніданок. Охолодження води компресійного типу. Для роботи буде потрібно приєднання мережевого шнура до розетки в 220 вольт 50 герц. Потужність нагріву становить 420 ват, а для охолодження призначене 100 ват. Такої потужності достатньо для ефективної роботи пристрою. Резервуар для нагріву води виготовлений з міцної нержавіючої харчової сталі. Продуктивність досягає чотирьох літрів на годину гарячої води в температурі від 90 до 95 градусів, і 2 літрів на годину холодної води з температурою 5-10 градусів Цельсія. Нагрівальний елемент трубчастого типу, внутрішній.`,
          characteristic: `<b>Вода:</b>  гаряча-холодна \n<b>Колір:</b> чорний \n<b>Розміщення бутлі:</b> зверху - на кулері\n<b>Тип охолодження:</b> компресорне охолодження \n <b>Продуктивність охолодження:</b> 2.0 л/г (10°C)\n <b>Продуктивність нагріву:</b> 5.0 л/г (90-95°C)\n <b>Потужність нагрiву:</b> 420 Вт\n <b>Потужність охолодження:</b> 100 Вт\n<b>Тип шафки:</b> без шафки \n <b>Захист від дітей:</b> є захист від дітей\n<b>Тип краника:</b> натиск рукою кнопки-клавiши\n<b>Сховище для одноразових стаканчиків:</b> купується окремо\n<b>Розмір ш*в*г (мм):</b> 360 * 980 * 330 мм\n<b>Вага (нетто):</b> 12 кг\n<b>Енергоспоживання:</b> 1.20 кВт г/добу\n<b>Клас енергоефективності:</b> В\n<b>Експлуатація при температурі:</b> від +10°C до +38°C\n<b>Гарантія:</b> 2 роки\n<b>Країна виробництва:</b> Країна збірки Гонг-Конг Виробник Cooper & Hunter (США)\n<b>Спосіб наповнення:</b> бутильована вода\n<b>Додаткові опції:</b> Захист від дітей`,
          price: ' 7500 грн',
          rentPrice: '400 грн/міс.',
          mortgagePrice: '3500 грн'
        },
        {
          image: cooler_5,
          header: 'VIO X601-FCB Black',
          description: `Кулер для води з компресорним типом охолодження - найоптимальніший і практичний варіант. Завдяки стильному і ергономічному дизайну, кулер ідеально впишеться в будь-який інтер'єр або навіть стане його прикрасою. Підлоговий кулер для води ViO X601-FCB - модель 2019 року в класичному чорному кольорі. Однією з особливостей даного кулера для води є нижнє завантаження бутлі. Це не тільки полегшує процес заміни бутлі, адже не треба піднімати тяжкість на висоту одного метра, а й забезпечує естетичний ефект. Крім того, захована бутель за дверцятами кулера, що не підпадає під вплив прямих сонячних променів, а якщо в будинку є маленькі діти, то Вам не варто турбуватися, що вони зможуть її перекинути.`,
          characteristic: `<b>Вода:</b>  гаряча-прохолодна-холодна \n<b>Колір:</b> чорний \n<b>Розміщення бутлі:</b> зверху - на кулері\n<b>Тип охолодження:</b> компресорне охолодження\n <b>Продуктивність охолодження:</b> 2.0 л/г (5-10°C)\n <b>Продуктивність нагріву:</b> 5.0 л/г (90-95°C)\n <b>Потужність нагрiву:</b> 500 Вт\n <b>Потужність охолодження:</b> 112Вт \n<b>Тип шафки:</b> нижнє завантаження бутлі - всередині кулера\n<b>Об'єм шафки:</b> 16 л\n<b>Захист від дітей:</b> є захист від дітей\n<b>Тип краника:</b> натиск рукою кнопки-клавiши\n<b>Сховище для одноразових стаканчиків:</b> купується окремо\n<b>Розмір ш*в*г (мм):</b> 355 * 1115 * 390 мм\n <b>Вага (нетто):</b> 14.3 кг\n <b>Енергоспоживання:</b> 1.20 кВт г/добу\n<b>Клас енергоефективності:</b> В\n<b>Експлуатація при температурі:</b> від +10°C до +38°C\n<b>Гарантія:</b> 2 роки\n<b>Наявність крана кімнатної температури:</b> так\n<b>Додаткові опції:</b> Захист від дітей, три режиму подачі води (гаряча, кімнатна і холодна)\n`,
          price: ' 10000 грн',
          rentPrice: '500 грн/міс.',
          mortgagePrice: '5000 грн'
        },
        {
          image: cooler_6,
          header: `Стаканотримач магнітний \n <p style="padding:10px;font-weight:100;font-size=100%;">(чорний, білий, молочний)</p>`,
          description: `Тримач для стаканів кріпиться до кулеру за допомогою магнітів.
Розподільний механізм внизу футляра відокремлює стакани один від іншого, видаючи по одному. Підсклянник розрахований на 70 стаканчиків.
Ємність для стаканчиків виготовлена з прозорого пластика, а кришка і кріпильна частина з пластика білого кольору.`,
          characteristic: `<b>Розмір коробки:</b> 88 * 430 * 99 мм \n<b>Вага товару:</b> 0.41 кг`,
          price: ' 500 грн',
          rentPrice: '',
          mortgagePrice: ''
        },
        {
          image: cooler_7,
          header: `Стаканотримач магнітний Hotfrost \n <p style="padding:10px;font-weight:100;font-size=100%;">(сріблястий, білий, чорний)</p>`,
          description: `Тримач для стаканів кріпиться до кулеру за допомогою магніту. Розподільний механізм внизу футляра відокремлює стакани один від іншого, видаючи по одному. Підсклянник розрахований на 70 стаканчиків. Підходять до використання склянки з діаметром від 6 до 7,5 см або ж об'ємом від 110-255 мл Ємність для стаканчиків виготовлена з прозорого пластика, а кришка і закріплююча частина з пластику чорного кольору.`,
          characteristic: `<b>Розмір коробки:</b> 90 * 520 * 100 мм \n <b> Розмір ш*в*г (мм):</b>  85 *518 *92 мм \n <b>Вага (нетто):</b> 0.42 кг \n<b> Вага (брутто):</b> 0.50 кг \n<b> Місткість стаканотримача (шт): 70 </b> `,
          price: ' 600 грн',
          rentPrice: '',
          mortgagePrice: ''
        }
      ]
    }
  }
}
</script>

<style scoped>
.page {
  position: relative;
  overflow: hidden;
}
.coolers-container {
  align-self: center;
  justify-content: center;
  padding: 3% 0;
  flex-direction: column;
}

.bubble {
  position: absolute;
  z-index: -1;
}

.bubble-1 {
  width: 160px;
  top: -3%;
}

.bubble-2 {
  width: 300px;
  top: 18%;
  right: 0;
  transform: rotate(90deg);
}

.bubble-3 {
  width: 200px;
  top: 32%;
  right: 0;
  transform: rotate(203deg);
}

.bubble-4 {
  width: 170px;
  top: 45%;
  left: -4%;
  transform: rotate(-90deg);
}

.bubble-5 {
  width: 270px;
  top: 60%;
  right: -10%;
}

.bubble-6 {
  width: 130px;
  top: 76%;
  right: 0;
  transform: rotate(257deg);
}

.bubble-7 {
  width: 300px;
  top: 94%;
  left: 0;
  transform: rotate(69deg);
}

@media (max-width: 420px) {
  .coolers-container {
    width: 90% !important;
  }
}

@media (max-width: 700px) {
  .bubble {
    display: none;
  }
}

@media (min-width: 421px) and (max-width: 650px) {
  .coolers-container {
    width: 90% !important;
  }
}
</style>
